SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-77000-H

Comment( British Rail Standard 3MT 2-6-0 Locomotive )

Comment( **Known Parameters Required for OR - Wagon Section**)

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_3MT_77000.s )
Size  ( 2.634666m 4.151885m 9.678091m )
Mass ( 57.5t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Break ( 710kN 1220kN )
			r0 ( 0cm 10cm )
		)
		CouplingHasRigidConnection (1)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Break ( 600kN 1000kN )
			r0 ( 10cm 20cm )
			)
	CouplingHasRigidConnection (0)
	)
	
Comment( ************ Brakes, Type, Force, etc *************** )
BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 158kN ) Comment(Brake % 55 WWO CoF 0.5)
MaxHandbrakeForce ( 0kN ) Comment(ctn calc)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21 ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.7m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 14.0ft 0.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DW x 18 )
ORTSDavis_A ( 5099 )
ORTSDavis_B ( 19.22 )
ORTSDavis_C ( 5.182 )

ORTSWagonFrontalArea (97ft^2)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 2
		Light	(
			comment( Front White Lamp Position D )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0 3.25 3.83 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
			Light	(
			comment( Front White Lamp Position C )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0 1.48 4.46 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.65 )
					)
				)
			)
		)

Comment( ******* Miscellaneous Wagon Information************ )

FreightAnim ( "..\\common.crew\\LIB_2\\Std4b.s" 0 3.0 0.0 )

Comment (Passenger View)	
	Inside (
	WagonShape ( DR_BR_3MT_77000.s )
        PassengerCabinHeadPos ( 1.423 3.1 -3.44 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)



Engine ( OR-77000-H

Comment( *Known Parameters Required for OR - Engine Section*)

Comment (Section for Engine Effects - Steam Emissions, Stack) 

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0 3.8 -2.7
				0 1 0
				0.15
			)

			SafetyValvesFX
			(
				0.154 4.0 -2.4
				0 1 0
				0.2
			)
			SafetytValvesFX
			(
				-0.154 4.0 -2.7
				0 1 0
				0.2
			)
			StackFX
			(
				0 4.32 2.6
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.32 2.6
				0 1 0
				0.25
			)
			StackFX
			(
				0 4.32 2.6
				0 1 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-1 -1 -1
				0.05
			)

			Injectors2FX
			(
				1.05 0.75 -4.2
				0 -1 -1
				0.15
			)
			Injectors1FX
			(
				1.05 0.75 -4.4
				0 -1 -1
				0.15
			)

			CylindersFX
			(
				-1.052 0.81 3.3
				0 0.1 1
				0.19
			)

			CylindersFX
			(
				1.052 0.81 3.3
				0 0.1 1
				0.19
			)
		)
	)

Wagon ( OR-77000-H )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 31.5in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 48.5t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 138ft^3 ) 
ORTSEvaporationArea ( 1042ft^2 )
ORTSSuperheatArea ( 118ft^2 )
MaxBoilerPressure ( 200psi )
MaxSteamHeatingPressure ( 80psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 2 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 17.5in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 20.35ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ********************* Fuel ************************* )

MaxTenderCoalMass ( 6t-uk )
MaxTenderWaterMass ( 35000lb )
IsTenderRequired( 1 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

ORTSBoilerEvaporationRate ( 15.5 ) 

ORTSMaxIndicatedHorsepower ( 1100.0hp ) 

ORTSMaxSuperheatTemperature ( 270.0 )

Comment(ORTSSuperheatCutoffPressureFactor ( 55.0 ))Comment(Default)

Comment(ORTSCylinderPortOpening ( 0.085 ))Comment(0.05 to 0.12)

ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 )Comment(From 4MT Report)

ORTSBurnRate( 0.0 10.0  8500.0 1000.0  13400.0 2000.0  15870.0 2500.0  17000.0 3000.0  19100.0 3500.0  20550.0 4000.0 ) Comment( From Pawson Graph )

ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 )

Comment(ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  ))

    
Comment ( *******************Brake System ******************** )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21 )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control Sysytem (if used)**********        

Includes Monitoring of Overspeed, Vigilance, Emergency Braking 

*************************************************************)

     
Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )
            
Brake_Hand ( 0 1 0.0125 0
	NumNotches ( 0 ))
FireDoor ( 4 4 0.4 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
SmallEjectorOrCompressor( 0 1 1 )
BellToggle( 0 1 0 )
Headlights( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( Standard4b.cvf )
HeadOut (  -1.423 3.1 -3.44 )
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
Name ( "77000 BR 3MT, Through Freight ClassH, BR2A Tender, Coal 6t, Water\n"+ " 3500gal" )
Description (
"The design and construction took place at the ex-Great Western Railway Swindon Works, along with the 2-6-2 tank engine version of the class, though some details were designed at Brighton, Derby and Doncaster.\n"+
"Unlike a number of the larger BR Standards the exhaust steam manifold within the smokebox saddle was a steel fabrication that was part of the welded saddle. In a number of the large BR standards (BR Standard Class 6 and Class 7 engines) the exhaust steam manifold was a steel casting welded into the saddle during manufacture.\n"+
"Only 20 were built, numbers 77000–77019, all at Swindon Works. Due to their small number, the class were the antithesis of 'standard' engines and it would probably have been better to build more 2-6-0s to the Standard Class 4 and Standard Class 2 designs instead. This class was the last class of steam locomotive on British Railways to remain complete before suffering its first withdrawal.")
)
